Revit 2027 API
PromptForFamilyInstancePlacementOptions(PromptForFamilyInstancePlacementOptions) Constructor
 Creates a copy of an existing options object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PromptForFamilyInstancePlacementOptions(
	PromptForFamilyInstancePlacementOptions other
)
Public Sub New (
	other As PromptForFamilyInstancePlacementOptions
)
public:
PromptForFamilyInstancePlacementOptions(
	PromptForFamilyInstancePlacementOptions^ other
)
new :
        other : PromptForFamilyInstancePlacementOptions -> PromptForFamilyInstancePlacementOptions
Parameters
other PromptForFamilyInstancePlacementOptions
 The options object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PromptForFamilyInstancePlacementOptions Class
PromptForFamilyInstancePlacementOptions Overload
Autodesk.Revit.UI Namespace